app/views/users/likes.html.erb

      <%# いいね！された投稿が削除されていた場合を想定 %>
      <% if post = Post.find_by(id:like.post_id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]