app/views/users/show.html.erb

    </ul>
    <% if @user.posts.size != 0 %>
      <% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]