app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 10], ["created_at", "2022-06-11 07:52:13.101987"], ["updated_at", "2022-06-11 07:52:13.101987"]]
---
    def create
        @like = Like.new(
            user_id:@current_user.id,
            post_id:params[:post_id]
        )
        @like.save

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 9], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 3]]
---
    def destroy
        @like = Like.find_by(
            user_id: @current_user,
            post_id: params[:post_id]
        )
        @like.destroy