app/controllers/posts_controller.rb

  def index
    # 降順
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    @post = Post.find_by(id:params[:id])
    @user = @post.user
    @likes_count = Like.where(post_id:@post.id).count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]

  def create
    # nameで指定している値を取得してDBに保存
    @post = Post.new(
      content:params[:content],
      user_id:@current_user.id
    )
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "a"], ["created_at", "2022-06-11 14:01:21.816064"], ["updated_at", "2022-06-11 14:01:21.816064"], ["user_id", 5]]

  def ensure_correct_user
    @post = Post.find_by(id:params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]